package com.company.mission1;

public class static004 {

}
/*
	Q. 다음 중 지역변수에 대한 설명으로 옳지 않은것은? (모두 고르시오)
	
	a. 지역변수가 선언된 메서드가 종료되면 지역변수도 함께 소멸
	b. 메서드의 매개변수로 선언된변수는 지역 변수이다
	c. 자동 초기화 되므로 별도의 초기화가 필요없다				o
	d. 힙 영역에 생성되며 가비지 컬렉터에 의해 소멸된다.		o
	e. 클래스변수나 인스턴스변수보다 메모리 부당이 크다			o


	Q. 다음 중 초기화에 대한 설명으로 옳지 않은 것은? (모두 고르시오)
	
	a. 초기화 블럭보다 생성자가 먼저 수행된다.						o
	b. 멤버변수는 자동초기화되므로 초기화하지 않고도 값을 참조할 수 있다.	
	c. 지역변수는 초기화하지 않아도 된다.							o
	d. 클래스변수보다 인스턴스변수가 먼저 초기화된다					o
	e. 명시적 초기화를 제일 우선적으로 고려해야한다.					
*/